[
  {
    "title": "Xys Bio",
    "image": "media/images/xysbio.png",
    "video": "media/videos/radiogym.webm",
    "description": "Xys Bio é um SaaS de portfólios digitais personalizáveis que une design moderno e alta performance para elevar a presença online de profissionais, marcas, gamers e streamers.",
    "link": "https://xys.bio/",
    "technologies": ["Java", "Spring", "TypeScript", "React", "Next.js", "PostgreSQL", "Docker", "AWS", "Nginx", "Cloudflare"]
  },
  {
    "title": "Radio Gym",
    "image": "media/images/radiogym.png",
    "video": "media/videos/radiogym.webm",
    "description": "Radio Gym é um sistema de streaming de áudios, consta com um um painel web para tocar músicas automaticamente dentro da academia, sincronizando com o sistema de gerenciamento da academia, permitindo controle em todas as unidades da Efficiency Gym. O sistema também pode exibir anúncios publicitários entre as músicas, permitindo monetização e informativos educativos.",
    "link": "https://radio.efficiencygym.com.br",
    "technologies": ["Python", "Flask", "Bucket S3", "JavaScript", "Websocket", "Nginx", "Cloudflare"]
  },
  {
    "title": "Web Whats",
    "image": "media/images/webwhats.png",
    "video": "media/videos/webwhats.webm",
    "description": "Web Whats é um sistema de gerenciamento de mensagens para WhatsApp com processamento inteligente usando regras, correspondência fuzzy e um sistema avançado de RAG (Retrieval Augmented Generation) com DeepSeek.",
    "link": "https://github.com/Matheus-Pedro/webwhats",
    "technologies": ["TypeScript", "Redis", "PostgreSQL", "Docker", "DeepSeek", "LLM", "RAG", "Fuzzy Matching", "Meta for Developers", "Nginx", "Cloudflare"]
  },
  {
    "title": "Efficommerce",
    "image": "media/images/efficommerce.png",
    "video": "media/videos/efficommerce.webm",
    "description": "Efficommerce é um sistema de e-commerce desenvolvido para a Efficiency Gym, permitindo aos clientes comprarem produtos da empresa e de parceiros. Até a data atual não foi oficialmente lançado, mas já está sendo testado e utilizado internamente pela empresa. Sua API foi desenvolvida em Dotnet 9 e seu frontend em Next.js.",
    "link": "https://github.com/Matheus-Pedro/efficommerce",
    "technologies": ["C#", "Dotnet", "PostgreSQL", "Docker", "Next.js", "Tailwind CSS", "Stripe", "AWS", "Nginx", "Cloudflare"]
  },
  {
    "title": "Orvall",
    "image": "media/images/orvall.png",
    "video": "media/videos/orvall.webm",
    "description": "O Orvall é o meu projeto de TCC, ele é um sistema ainda em desenvolvimento para captura de dados meteorológicos e previsão do tempo realizada por Machine Learning, com um painel web para visualização dos dados e da previsão, e um painel para o usuário cadastrar-se e receber alertas via WhatsApp sobre a ocorrência de fenômenos meteorológicos raros em sua região. Focado para agricultores, o sistema foi desenvolvido para capturar dados de forma automática e eficiente, e fornecer informações precisas para o usuário sobre o que plantar e quando.",
    "link": "https://orvall.com.br",
    "technologies": ["C#", "Dotnet", "C++", "ESP32", "Python", "PostgreSQL", "Docker", "Next.js", "Tailwind CSS", "Ubuntu", "Nginx", "Cloudflare"]
  }
]
